Repository: mariamm144/25620125B
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: Place the Spinach and Ricotta Rolls into the oven to cook for 25 minutes or until the pastry is golden and crispy.
es: Introduce los rollitos de espinaca y ricotta en el horno durante 25 minutos o hasta que la masa quede dorada y crujiente.

source: Place the apple pieces into a small bowl and add the cinnamon before gently stirring to combine.
es: Pon los trozos de manzana en un bol pequeño y añada la canela antes de remover suavemente para combinar.

source: Place the bacon (roughly chopped), into the Thermomix bowl and press Turbo in 1 second bursts until chopped into small pieces.
es: Introduce el bacon (cortado en trozos grandes) en el vaso Thermomix y pulsa Turbo en ráfagas de 1 segundo hasta que quede picado en trozos pequeños.

source: Place the bao buns onto the 2 trays of the Varoma.
es: Coloca los bao buns en las 2 bandejas del Varoma.

source: Place the biscuits into the Thermomix bowl and crush for 10 seconds, Speed 8.
es: Echa las galletas María en la Thermomix 10 segundos, velocidad 8.

source: Place the butter and caster sugar into the Thermomix bowl.
es: Coloca la mantequilla y el azúcar glas en el bol de Thermomix.

source: Place the butter and caster sugar into your Thermomix bowl and mix for 15 seconds, speed 3 to combine.
es: Coloca la mantequilla y el azúcar molido en el vaso de tu Thermomix y mezcla durante 15 segundos, velocidad 3 para homogenizar.

source: Place the butter and caster sugar into your Thermomix bowl and mix for 30 seconds, Speed 3. Scrape down the sides of the bowl and mix for a further 20 seconds, Speed 3.
es: Coloca la mantequilla en el bol de Thermomix y remueve durante 30 segundos a velocidad 3. Raspa las paredes de los lados del bol y mezcla durante otros 20 segundos, velocidad 3.

source: Place the butter into the Thermomix bowl (don't worry about cleaning it) and melt for 1 minute, 100 degrees, Speed 3.
es: Pon la mantequilla en el vaso de la Thermomix (no te preocupes por limpiarlo) y derrítelo por 1 minuto, a 100 grados, velocidad 3.

source: Place the butter into your Thermomix bowl and cook for 2 minutes, 60 degrees, Speed 1 (or until melted).
es: Pon la mantequilla en el vaso de tu Thermomix y cocínala durante 2 minutos, a 60 grados, velocidad 1 (o hasta que se derrita).

source: Place the butter into your Thermomix bowl and cook for 2 minutes, 60 degrees, speed 2 or until melted.
es: Pon la mantequilla en el vaso de tu Thermomix y cocínalo 2 minutos, a 60 grados, velocidad 2 o hasta que se derrita.

source: Place the butter into your Thermomix bowl and mix for 20 seconds, speed 2.
es: Pon la mantequilla en el bol de tu Thermomix y mezcla durante 20 segundos, velocidad 2.

source: Place the butter, brown sugar, honey and cinnamon into the TM bowl.
es: Coloca la mantequilla, el azúcar moreno, la miel y la canela en el vaso de la TM.

source: Place the cake tin into the oven and cook for 30 – 35 minutes or until your marble cake is cooked through when tested with a skewer.
es: Coloca el molde en el horno y cocina las magdalenas durante 30-35 minutos o hasta que estén hechas al probarlos con una brocheta.

source: Place the cheese into the Thermomix bowl and grate on Speed 8, 10 seconds.
es: Pon el queso en el vasoThermomix y rállalo a velocidad 8, durante 10 segundos

source: Place the dough into a greased ThermoServer or large bowl and set aside in a warm, dry place to rise for 45 minutes.
es: Coloca la masa en un ThermoServer engrasado o en un bol grande ydeja reposar en un lugar cálido y seco para que suba durante 45 minutos.

source: Place the dough onto the centre of the tray and cut a couple of tiny slits with a very sharp knife on the top of the dough.
es: Coloca la masa en el centro de la bandeja y haz un par de pequeñas hendiduras con un cuchillo muy afilado en la parte superior de la masa.

source: Place the flour, butter and salt into the Thermomix bowl and mix for 10 seconds on Speed 9 until mixture is the same consistency as bread crumbs.
es: Pon la harina, la mantequilla y la sal en el vaso de la Thermomix y mezcla durante 10 segundos, velocidad 9 hasta que la mezcla tenga la misma consistencia que el pan rallado.

source: Place the flour, salt, water and sourdough into the Thermomix bowl.
es: Coloca la harina, la sal, el agua y la masa madre en el vaso Thermomix.

source: Place the garlic clove into the Thermomix bowl and chop for 5 seconds, Speed 6.
es: Coloca el diente de ajo dentro del vaso de la Thermomix y pica por 5 segundos, velocidad 6.

source: Place the mixture into a greased bowl (or ThermoServer) and leave in a warm place to rise until doubled in size (approximately 1 hour).
es: Coloca la mezcla en un cuenco engrasado (o ThermoServer) y deja que suba en un lugar cálido hasta que doble su tamaño (aproximadamente 1 hora.)

source: Place the onion and garlic into your Thermomix bowl and blitz for 3 seconds, speed 6 to grate.
es: Coloca la cebolla y el ajo dentro del vaso de la Thermomix y tritura durante 3 segundos, velocidad 6 para rallar.

source: Place the partially thawed pastry squares on your bench and cut in half lengthways.
es: Coloca los cuadrados de masa parcialmente descongelados ycórtalos por la mitad a lo largo.

source: Place the rice basket on top of the Thermomix and weigh in the sushi rice.
es: Coloca el cestillo del arroz encima de la Thermomix y pesa el arroz para sushi.

source: Place the rissoles into a frying pan with a little olive oil and cook for approximately 3 -4 minutes on each side or until cooked through.
es: Pon las croquetas en una sartén con un poco de aceite de oliva y cocínalas durante unos 3-4 minutos por cada lado o hasta que estén bien hechas.

source: Place the rolls into the fridge for an hour before cutting – this allows the rolls to set making it easier to cut and serve.
es: Pon los rollitos en el frigorífico durante una hora antes de cortarlos, esto permite que los rollitos se asienten haciendo que sean más fáciles de cortar y servir.

source: Place the sheets of puff pastry on a flat bench to defrost.
es: Coloca las láminas de hojaldre sobre una encimera plana para que se descongelen.

source: Place the toasted muesli, rice bubbles and sultanas into the TM bowl and mix or 30 seconds, REVERSE, Speed 2, or until completely combined.
es: Coloca el muesli tostado, las burbujas de arroz y las pasas sultanas en la TM y mezcla durante 30 segundos, REVERSO, velocidad 2, o hasta que esté completamente mezclado.

source: Place the tray into the fridge and leave for a minimum of four hours (overnight is best) before cutting into bars.
es: Coloca la bandeja en el frigorífico y déjala reposar un mínimo de cuatro horas (mejor toda la noche) antes de cortarla en barritas.

source: Place the tray on the shelf above the water tray and cook for 30-35 minutes or until a crust has formed and the loaf sounds hollow when tapped.
es: Coloca la bandeja en el estante por encima de la bandeja de agua y hornea durante 30-35 minutos o hasta que se haya formado una corteza y el pan suene hueco al golpearlo.

source: Place the water and yeast into the Thermomix bowl.
es: Introduce el agua y la levadura en el vaso Thermomix.

source: Place the water into the Thermomix bowl, insert the rice basket, secure the lid and cook for 20 minutes, Varoma, Speed 4.
es: Pon el agua en el bol del Thermomix, introduce el cestillo del arroz, asegura la tapa y cuece durante 20 minutos, Varoma, velocidad 4.

source: Place your filling in a thin line in the centre.
es: Coloca el relleno en una fina línea en el centro.

source: Plain flour can be used instead of Baker's Flour
es: Se puede utilizar harina común en lugar de harina de panadería

source: Please note it may take longer for your mixture to combine if your butter is not at room temperature.
es: Pof favor, ten en cuenta que si la mantequilla no está a temperatura ambiente, la mezcla tardará más en mezclarse.

source: Please note the egg does help to bind the rissoles together.
es: Ten en cuenta que el huevo ayuda a unir las croquetas.

source: Please note these biscuits will soften after a couple of days, especially if iced.
es: Ten en cuenta que estas galletas se ablandarán al cabo de un par de días, sobre todo si tienen glaseado.

source: Plus, they're freezer-friendly, so you'll always have a batch ready!
es: Además, son aptos para el congelador, ¡así que siempre tendrás una tanda lista!

source: Pour into a bowl and set aside.
es: Pasa a un plato y deja apartados.

source: Pour into a tall glass and serve immediately.
es: Vierte en un vaso alto y sirve inmediatamente.

source: Pour the melted chocolate over the top and decorate with extra mini Easter eggs.
es: Vierte el chocolate fundido por encima y decora con los mini huevos de Pascua extra.

source: Pour the mixture into your prepared loaf tin and sprinkle the apple pieces over the top.
es: Vierte la mezcla en el molde preparado y oon los trozos de manzana encima.

source: Pour the mixture over the pastry cases (being careful not to overfill as the mixture rises when cooked).
es: Vierte la mezcla sobre los moldes (con cuidado de no llenarlos demasiado, ya que la mezcla sube al cocinarse).

source: Pre-heat your oven to 180 degrees celsius (fan-forced) and line two baking trays with baking paper.
es: Precalienta el horno a 180 grados celsius (con ventilador) y cubre una bandeja de horno con papel de hornear.

source: Preheat oven to 180 degrees celsius (fan-forced).
es: Precalentar el horno a 180 grados centígrados (con el ventilador).

source: Preheat oven to 180 degrees celsius (fan-forced). Grease and line 3 baking trays and set aside (or as many trays as will fit in your oven).
es: Precalienta el horno a 180 grados centígrados (con ventilador). Engrasa y forra 3 bandejas (o cuantas te quepan en el horno) y deja a un lado.

source: Preheat oven to 200 degrees celsius (fan-forced).
es: Precalienta el horno a 200 grados centígrados (con ventilador).

source: Preheat the oven to 210 degrees celsius (fan-forced) or 230 degrees celsius (non fan-forced).
es: Precalienta el horno a 210 grados (con ventilador) o 230 grados (sin ventilador).

source: Preheat your frying pan with a little bit of butter over a medium high heat and add tablespoon amounts of the pikelet mixture.
es: Precalienta tu sartén con un poco de mantequilla a una temperatura media-alta y añade cucharadas de la masa de los pikelets.

source: Preheat your frying pan with a little butter over a medium high heat and add tablespoons of the pikelet mixture.
es: Precalienta la sartén con un poco de mantequilla a fuego medio-alto y añade las cucharadas de la mezcla.

source: Preheat your oven to 180 degrees (fan-forced) and line the base and sides of a large loaf tin with baking paper.
es: Precalienta el horno a 180 grados centígrados (con ventilador) y forra la base y las paredes de un molde con papel de cocina.

source: Preheat your oven to 180 degrees celsius (fan-forced) and line a 12-hole muffin tray with paper cases.
es: Precalienta el horno a 180 grados centígrados (con ventilador) y forra con papel de hornear una bandeja con 12 huecos para magadalenas.

source: Preheat your oven to 180 degrees celsius (fan-forced) and line a 20cm round baking tin with baking paper.
es: Precalienta el horno a 180 grados centígrados (con ventilador) y forra un molde redondo de 20 cm con papel de cocina.

source: Preheat your oven to 210 degrees celsius (fan-forced) and line an oven tray with baking paper.
es: Precalienta el horno a 210 grados centígrados (con ventilador) y forra una bandeja de horno con papel de hornear.

source: Prep Time 15 minutes
es: Tiempo depreparación 15 minutos

source: Prep Time10 minutes
es: Tiempo de preparación: 10minutos

source: Prep Time5 minutes
es: Tiempo de preparación: 5minutos

source: Prep Time 10 minutes
es: Tiempo de preparación 10 minutos

source: Prep Time 2 minutes
es: Tiempo de preparación 2 minutos

source: Prep Time 20 minutes
es: Tiempo de preparación 20 minutos

source: Prep Time 5 minutes
es: Tiempo de preparación: 5 minutos

source: Prep Time2 minutes
es: Tiempo de preparación2 minutos

source: Press the mixture firmly into the prepared baking tin (using the trick of placing another tray on top and pressing down very firmly).
es: Presiona la mezcla firmemente en el molde preparado (utilizando el truco de colocar otra bandeja encima y presionar muy firmemente.)

source: Press the olives and rosemary leaves lightly into the mixture.
es: Presiona ligeramente las aceitunas y las hojas de romero sobre la mezcla.

source: Proving Time 45 minutes
es: Tiempo de reposo 45 minutos

source: Proving Time1 hour
es: Tiempo de reposo1 hora

source: Proving Time8 hours
es: Tiempo de reposo8 horas

source: Proving time 1 hour
es: Tiempo de reposo 1hora

source: Punch the dough down and then spread onto the prepared baking tray.
es: Extiende la masa en la bandeja de horno preparada.

source: RECIPE NOTES & TIPS
es: NOTAS Y CONSEJOS SOBRE LA RECETA

source: Remove from the fridge 20 minutes before cutting into slices (this makes it easier to cut).
es: Sácalo de la nevera 20 minutos antes de cortarlo (así es más fácil).

source: Remove from the oven and let the biscuits cool on the oven trays for 10 minutes before transferring to a wire rack to cool completely.
es: Sácalas del horno y dejar enfriar las galletas en las bandejas durante 10 minutos antes de pasarlas a una rejilla para que se enfríen completamente.

source: Remove the bowl from your machine and use a table spoon to scoop up the mixture and roll into a ball.
es: Retira el vaso de la máquina y utiliza una cucharapara recoger la mezcla y formar una bola.

source: Remove the slice from the fridge 20 minutes before cutting (this helps to stop the chocolate layer on top from cracking).
es: Sácalos de la nevera 20 minutos antes de cortar (esto ayuda a que la capa de chocolate de la parte superior no se agriete.)

source: Remove the sushi rice from the basket once cooked – if you leave the sushi rice to sit in the rice basket after the cooking time, it will become gluggy.
es: Quitar el arroz de sushi de la cesta:si dejas el arroz de sushi en la cesta tras el tiempo de cocción, se quedará pegajoso.

source: Repeat process until all the pastry and Spinach and Ricotta mixture has been used.
es: Repite el proceso hasta que se haya utilizado toda la masa y la mezcla de espinacas y ricotta.

source: Repeat until all of the mixture has been used.
es: Repite hasta que la mezcla se acabe.

source: Return to the greased bowl, cover and allow to prove for another 4 hours (for best results, cover and place into the fridge overnight to prove.
es: Vuelve a ponerlo en el vaso engrasado, cúbrelo y deja que fermente durante otras 4 horas (para obtener mejores resultados, cúbrelo y ponlo en el frigoríficodurante toda la noche para que fermente).

source: Rip a piece of baking paper into strips and place over the 2 layers of the Varoma trays (leaving gaps in between to allow the steam to escape).
es: Rasga un trozo de papel de horno en tiras y colócalo sobre las 2 capas de las bandejas Varoma (dejando huecos entre ellas para que salga el vapor.)

source: Ripe Bananas - When baking with bananas the general rule is the riper the better!
es: Plátanos maduros - Cuando se trata de hornear con plátano la regla general es: ¡cuanto más maduro mejor!!

source: Roll into balls and flatten down into a circle/oval shape.
es: Haz bolas y aplástalas en forma de círculo u óvalo.

source: Roll into teaspoon-sized balls and place onto the prepared baking trays.
es: Forma bolas del tamaño de una cucharadita y colócalas en las bandejas de horno preparadas..

source: Roll the dough on your bench until it's approximately 4 mm thick and use the cutter of your choice to make shapes.
es: Enrolla la masa en la encimera hasta que tenga aproximadamente 4 mm de grosor y utiliza el cortador de tu elección para hacer formas

source: Roll the mixture into balls.
es: Haz bolitas con la mezcla.

source: Roll the pastry (starting from the edge without the egg) to enclose the filling.
es: Enrolla la masa (empezando por el borde sin el huevo) para encerrar el relleno.

source: Rolling Pin
es: Rodillo de cocina

source: Scrape down the sides of the bowl and mix for a further 10 seconds, speed 4 or until the mixture is well combined.
es: Raspa las paredes del vaso Thermomix y mezcla durante 10 segundos más, velocidad 4 o hasta que la mezcla esté bien homogénea.

source: Scrape down the sides and melt for a further 30 seconds, 100 degrees, Speed 3 (if needed).
es: Raspa las paredes del vaso y derrítelo por unos 30 segundos más, velocidad 3.

source: Scrape down the sides of the Thermomix bowl and mix for a further 20 seconds, speed 3 or until pale and creamy.
es: Raspa los laterales de tu cuenco de Thermomix y remueve todo durante 20 segundos más en la velocidad 3 o hasta que tenga un aspecto claro y cremoso.

source: Scrape down the sides of the bowl between mixing.
es: Raspa las paredes del vaso entre mezcla y mezcla.

source: Scrape down the sides of the bowl and add the mince, sauces and egg to your Thermomix bowl and mix for 15 seconds, speed 5 to combine.
es: Raspa las paredes del vaso y añade la carne picada, las salsas y el huevo, y mezcla durante 15 segundos, velocidad 5 para homogeneizar.

source: Scrape down the sides of the bowl and add the plain flour and mix for 10 seconds, speed 4.
es: Raspa los laterales de tu cuenco, añade la harina y remuévelo durante 10 segundos a velocidad 4.

source: Scrape down the sides of the bowl and mix for a further 10 seconds, speed 4 or until the mixture is smooth and well combined.
es: Raspa los laterales del cuenco de Thermomix y remueve todo a velocidad 4 durante 10 segundos más o hasta que se mezcle bien.

source: Scrape down the sides of the bowl and mix for a further 20 seconds, Speed 3.
es: Raspa las paredes de los lados del bol y mezcla durante otros 20 segundos a velocidad 3.

source: Scrape down the sides of the bowl and mix for a further 5 seconds, Speed 4 or until well combined.
es: Raspa los laterales de tu bol de Thermomix y remueve todo a velocidad 4 durante 5 segundos más o hasta que se mezcle bien.

source: Scrape down the sides of the bowl and mix for a further 5 seconds, Speed 5.
es: Raspa las paredes de los lados del vaso y mezcla durante otros 5 minutos, velocidad 5.

source: Scrape down the sides of the bowl and mix for a further 5 seconds, speed 4.
es: Raspa las paredes de los lados del vaso y mezcla durante otros 5 minutos, velocidad 4.

source: Scrape down the sides of the bowl and mix on Interval (knead) function for 2 minutes.
es: Limpia las paredes del vaso y mezcla en la función Intervalo (amasar) durante 2 minutos.

source: Scrape down the sides of the bowl and repeat for a further 5 seconds.
es: Raspa las paredes de los lados del vaso y mezcla durante otros 5 segundos.

source: Scrape down the sides of your Thermomix bowl and add the caster sugar, baking powder and salt and mix for 20 seconds, speed 3.
es: Raspa las paredes del bol del Thermomix y añade el azúcar glas, la levadura en polvo y la sal y mezcla durante 20 segundos, velocidad 3.

source: Scrape down the sides of your bowl and mix for a further 15 seconds, speed 3 or until pale and creamy.
es: Apura los laterales de tu vaso de Thermomix y remueve todo durante 15 segundos más, velocidad 3 o hasta que tenga un aspecto claro y cremoso.

source: Select the Kneading Function and mix for 2 minutes.
es: Selecciona la función de amasar y mezcla por dos minutos.

source: Select the kneading function and mix for 40 seconds.
es: Selecciona la función de amasar y mezcla por 40 segundos.

source: Serve drizzled with olive oil and sprinkled with paprika (optional).
es: Sírvelo con un poco de aceite y pimentón en polvo (opcional).

source: Serve the quiches on their own, or with your favourite sauces and chutneys.
es: Sirve las quiches solas o acompañadas de tus salsas y salsas chutneys favoritas.

source: Serve these pikelets warm with your choice of toppings.
es: Sirve estos pikelets calientes con los toppings de tu elección.

source: Serve with a drizzle of olive oil and a sprinkle of paprika (optional)
es: Sirve con un chorrito de aceite de oliva y una pizca de pimentón (opcional)

source: Servings10 Slices
es: Porciones: 10 trozos

source: Servings10 pieces
es: Porciones: 10 trozos

source: Servings100 cookies
es: Porciones: 100 galletas

source: Servings12
es: Porciones: 12

source: Servings16 balls
es: Porciones: 16 bolitas

source: Servings24 biscuits
es: Porciones: 24 galletas

source: Servings 15 Buns
es: Raciones 15 Bollos

source: Servings 24 quiches
es: Raciones 24 quiches

source: Servings 10 pieces
es: Raciones 10 piezas

source: Servings 10 serves
es: Raciones 10 porciones

source: Servings 12 muffins
es: Raciones12

source: Servings 12 scrolls
es: Raciones 12 de rollito

source: Servings 16
es: Porciones 16

source: Servings 16 pieces
es: Raciones 16 porciones

source: Servings 24 Pikelets
es: Raciones24 Pikelets

source: Servings 32 rolls
es: Raciones 32 rollos

source: Servings 40 Biscuits
es: Raciones 40 galletas

source: Servings 5 rolls
es: Raciones5 rollitos

source: Servings1
es: Raciones1

source: Servings1 loaf
es: Porciones1

source: Servings10 Rissoles
es: Raciones10 croquetas frías

source: Servings20 pikelets
es: Raciones20 pikelets

source: Servings8 pieces
es: Raciones8 trozos

source: Slice the Spinach and Ricotta Rolls into four equal parts and brush with a little more of the beaten egg and sprinkle with sesame seeds if desired.
es: Corta los rollitos de espinacas y ricotta en cuatro partes iguales y pincélalos con un poco más del huevo batido y espolvoréalos con semillas de sésamo si lo deseas.

source: Spoon the mixture into the prepared muffin tin (filling to ⅔ full) and bake for 18-20 minutes or until golden and cooked through when tested with a skewer.
es: Vierte la mezcla en el molde para magadalenas (llenándolo hasta ⅔ de su capacidad) y hornea durante 18-20 minutos o hasta que se doren y estén hechos al probarlos con una brocheta.

source: Spoon the mixture into the prepared tray and press down firmly with a spoon.
es: Vierte la mezcla en la bandeja preparaday presiona firmemente con una cuchara.

source: Spread a thin layer of cooked sushi rice (approximately ½ cup) over the sheet of nori (leaving a 2cm gap at the top of the sheet – to assist with sealing) and press down with the flat side of a spoon.
es: Unta una delgada capa del arroz cocido (aproximadamente media taza) sobre la hoja de nori (dejando un margen de 2 cm encima de la hoja– para ayudarte al cerrarlo) y aplástala con la parte plana de la cuchara.

source: Spread the Vegemite over the dough, leaving a 2cm gap around the edges.
es: Unta la vegemite sobre la masa, dejando un hueco de 2 cm alrededor de los bordes.

source: Sprinkle over the chocolate chips and firmly press down again.
es: Espolvorea las pepitas de chocolate por encima y vuelve a presionar firmemente.

source: Sprinkle with extra sea salt and bake for 25-30 minutes or until golden.
es: Espolvorea con sal marina extra y hornea durante 25-30 minutos o hasta que esté dorado.

source: Sprinkle with sesame or poppy seeds (optional).
es: Espolvorea con semillas de sésamo o de amapola (opcional).

source: Start from the end without the gap and roll tightly together (it takes a bit of practice).
es: Empieza desde el final sin el margen y enróllalo de manera apretada (requiere un poco de práctica.)

source: Store in an airtight container in the fridge for 3-4 days.
es: Guárdalo en un recipiente hermético en el frigorífico durante 3 o 4 días.

source: Store in an airtight container at room temperature for up to a week.
es: Consérvalo en un recipiente hermético a temperatura ambiente hasta una semana.
